'use strict';
/* Задание на урок:

1) Создать переменную numberOfFilms и в неё поместить ответ от пользователя на вопрос:
'Сколько фильмов вы уже посмотрели?'

2) Создать объект personalMovieDB и в него поместить такие свойства:
    - count - сюда передается ответ на первый вопрос
    - movies - в это свойство поместить пустой объект
    - actors - тоже поместить пустой объект
    - genres - сюда поместить пустой массив
    - privat - в это свойство поместить boolean(логическое) значение false

3) Задайте пользователю по два раза вопросы:
    - 'Один из последних просмотренных фильмов?'
    - 'На сколько оцените его?'
Ответы стоит поместить в отдельные переменные
Записать ответы в объект movies в формате: 
    movies: {
        'logan': '8.1'
    }

Проверить, чтобы все работало без ошибок в консоли */

const numberOfFilms = +prompt('Сколько фильмов вы уже посмотрели?', '');
//Создаём переменную и спрашиваем вопрос = ответ сохраняется в переменной

//Создали снизу объект со свойствами.
const personalMovieDB = {
    count: numberOfFilms,
    movies: {},
    /* {} - означают пустой объект */
    actors: {},
    genres: [],
    /* Создание массива [ $$$ ]*/
    privat: false
};

//Задаём пользователю по два раза вопросы создавая новые переменные.
const a = prompt('Один из последних просмотренных фильмов?', ''),
    b = +promt('На сколько оцените его?', ''),
    c = prompt('Один из последних просмотренных фильмов?', ''),
    d = +promt('На сколько оцените его?', '');


//Присвоили свойству объекта 'фильмы' конст. a и оцценку b
personalMovieDB.movies[a] = b;
personalMovieDB.movies[c] = d;


console.log(personalMovieDB);